#โปรแกรมช่วยพัฒนาการเงิน

GetMoney = int(input("รายรับทั้งหมด: "))
OutMoney = int(input("รายจ่ายทั้งหมด: "))
Day = int(input("วันที่:"))

ยอดคงเหลือ = GetMoney - OutMoney
print("ยอดเงินคงเหลือเท่ากับ:",ยอดคงเหลือ)

คิดเป็นกี่เปอร์เซนต์ของการใช้จ่าย = OutMoney * 100 / GetMoney
print(f"เปอร์เซนต์ของการใช้จ่ายเท่ากับ: {คิดเป็นกี่เปอร์เซนต์ของการใช้จ่าย:.2f}%")


คิดเป็นกี่เปอร์เซนต์ของการออม = ยอดคงเหลือ * 100 / GetMoney
print(f"เปอร์เซนต์ของการออมเท่ากับ: {คิดเป็นกี่เปอร์เซนต์ของการออม:.2f}%")

เฉลี่ยการใช้จ่ายต่อวัน = OutMoney / Day
print(f"เฉลี่ยการใช้จ่ายต่อวัน: {เฉลี่ยการใช้จ่ายต่อวัน:.2f} บาท")

เฉลี่ยการออม = ยอดคงเหลือ / Day
print(f"เฉลี่ยการออมต่อวัน: {เฉลี่ยการออม:.2f} บาท")

